/*
 Дефинирајте апстрактна класа Museum со следниве спецификации (5 поени):

Име на музејот (низа од максимум 50 знаци/стринг)
Град во кој се наоѓа (низа од максимум 50 знаци/стринг)
Основна цена на билет (реален број)
Број на работни часови во неделата (цел број)

Дополнително, класата треба да содржи двe чисто виртуелни функции-членови на класaта:

void printDetails() - функција која ги печати информациите за објектот
double calculateTicketCost() - функција која враќа цена на билет за посета на музеј
Да се дефинираат две класи, ScientificMuseum и ArtMuseum, кои наследуваат од класата Museum (5 поени).

За класата ScientificMuseum дополнително се чува информација за интерактивни поставки во рамки на музејот (Boolean променлива), како и информација за број на мултимедијални презентации кои може да се посетат во музејот (целобројна променлива).

Цената на билет (функција double calculateTicketCost()) за ScientificMuseum се пресметува на следниот начин:

Ако музејот нуди интерактивни поставки, тогаш цената се зголемува за 12%.
Дополнително, секоја мултимедијална презентација ја зголемува цената за $6.

Функцијата void printDetail() ги печати карактеристиките за музејот во следниот формат:

[Ime na muzej] - (Scientific) [Grad] [Broj na mult. prezentacii] [Cena na karta] (10 поени)

За класата ArtMuseum дополнително се чува информација за тоа дали музејот нуди опции за аматерски изложби (Boolean променлива), како и информација за бројот на оригинални не-реставрирани уметнички дела (цел број).

Цената на билет (функција double calculateTicketCost()) за  ArtMuseum се пресметува на следниот начин:

Ако музејот нуди опција за аматерски изложби, тогаш цената се намалува за 18%.
Дополнително, секое оригинално не-реставрирано дело ја зголемува цената за $3.

Функцијата void printDetail() ги печати карактеристиките за музејот во следниот формат:

[Ime na muzej] - (Art) [Grad] [Amaterski izlozbi] [Cena na karta] (10 поени)

Да се дефинира следната глобална функција:

int findCheapestScientificMuseum(Museum **m, int n) која како аргумент прима низа од покажувачи кон музеи и големина на низата, а како резултат го враќа индексот на научниот музеј (ScientificMuseum) кој има најниска цена на карта во низата.
 Доколку не постои таков објект во низата, функцијата враќа -1. Ако повеќе музеи имаат иста цена на картата, се избира тој со повеќе работни часови во неделата (последниот таков). (20 поени)

 Input:
3
2
1
Science and Tech Museum
New York
15.5
40
1
5
2
Modern Art Museum
Chicago
18.0
35
1
203

 Output:
 Science and Tech Museum - (Scientific) New York 5 47.36
Modern Art Museum - (Art) Chicago 1 623.76
printDetail method OK
 */